2022-01-30-using-stylecop-with-unity.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="How to configure a Unity game engine project to use the StyleCop static analysis tool for C# code">
<link rel="alternate"
      type="application/rss+xml"
      href="https://eliza.sh/rss.xml"
      title="RSS feed for https://eliza.sh/">
<title>Using StyleCop with Unity</title>
<meta name="author" content="Eliza Velasquez">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="width=device-width, initial-scale=1.0"/>
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon-96.png"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://eliza.sh">Index</a>
  <a href="https://eliza.sh/archive.html">Archive</a>
  <a href="https://github.com/elizagamedev/">GitHub</a>
  <a href="https://twitter.com/elizagamedev">Twitter</a>
</div></div>
<div id="content">
<div class="post-date">30 Jan 2022</div><h1 class="post-title"><a href="https://eliza.sh/2022-01-30-using-stylecop-with-unity.html">Using StyleCop with Unity</a></h1>
<p>
Sometimes, it feels like you have to fight tooth and nail to get Unity to <a href="https://eliza.sh/2021-06-01-using-unity-editor-with-emacs.html">do the
right thing</a>. Using <a href="https://github.com/DotNetAnalyzers/StyleCopAnalyzers">StyleCop Analyzers</a> in a project is no exception.
</p>

<div id="outline-container-org-d9f3d339-7c64-4c2c-8d72-52fef8584f67" class="outline-2">
<h2 id="org-d9f3d339-7c64-4c2c-8d72-52fef8584f67">Foreground: What is StyleCop?</h2>
<div class="outline-text-2" id="text-org-d9f3d339-7c64-4c2c-8d72-52fef8584f67">
<p>
StyleCop.Analyzers is technically a static analysis tool for C#, but mostly
does code style enforcement. It's comparable to <a href="https://eslint.org/">ESLint</a>, a similar tool for
JavaScript.
</p>

<p>
StyleCop "Classic" was an implementation of the same idea, but
StyleCop.Analyzers uses the .NET Compiler Platform for code analysis, making it
pluggable into the <a href="https://www.omnisharp.net/">OmniSharp language server</a>.
</p>

<p>
<b>Sidenote:</b> If you are not using OmniSharp for your Unity code, you're missing
out on some of the best tooling for any programming language, period. Also, this
guide won't be useful to you until you have it configured, anyway. Visual Studio
and <a href="https://www.jetbrains.com/resharper/">ReSharper</a> have support built in, but other editors require some tweaking. My
article on using <a href="https://eliza.sh/2021-06-01-using-unity-editor-with-emacs.html">Unity/OmniSharp/Emacs</a> might be helpful even if you aren't an
Emacs user.
</p>
</div>
</div>

<div id="outline-container-org-d5f7d480-7b0c-4026-8331-8622db4d8b8d" class="outline-2">
<h2 id="org-d5f7d480-7b0c-4026-8331-8622db4d8b8d">How is this normally done?</h2>
<div class="outline-text-2" id="text-org-d5f7d480-7b0c-4026-8331-8622db4d8b8d">
<p>
In modern, non-Unity C# projects, this is typically done by just adding a
reference to StyleCop.Analyzers to the csproj file to be retrieved via NuGet.
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">Project</span> <span style="color: #00d3d0;">Sdk</span>=<span style="color: #79a8ff; font-style: italic;">"Microsoft.NET.Sdk"</span><span style="color: #e0e6f0;">&gt;</span>
  <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">ItemGroup</span><span style="color: #e0e6f0;">&gt;</span>
    <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">PackageReference</span> <span style="color: #00d3d0;">Include</span>=<span style="color: #79a8ff; font-style: italic;">"StyleCop.Analyzers"</span> <span style="color: #00d3d0;">Version</span>=<span style="color: #79a8ff; font-style: italic;">"1.2.0-beta.376"</span><span style="color: #e0e6f0;">&gt;</span>
      <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">IncludeAssets</span><span style="color: #e0e6f0;">&gt;</span>
        runtime; build; native; contentfiles; analyzers; buildtransitive
      <span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">IncludeAssets</span><span style="color: #e0e6f0;">&gt;</span>
      <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">PrivateAssets</span><span style="color: #e0e6f0;">&gt;</span>all<span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">PrivateAssets</span><span style="color: #e0e6f0;">&gt;</span>
    <span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">PackageReference</span><span style="color: #e0e6f0;">&gt;</span>
    <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">AdditionalFiles</span> <span style="color: #00d3d0;">Include</span>=<span style="color: #79a8ff; font-style: italic;">"stylecop.json"</span> <span style="color: #e0e6f0;">/</span><span style="color: #e0e6f0;">&gt;</span>
  <span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">ItemGroup</span><span style="color: #e0e6f0;">&gt;</span>
<span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">Project</span><span style="color: #e0e6f0;">&gt;</span>
</pre>
</div>

<p>
Two lines in particular here are relevant for Unity: <code>&lt;PackageReference&gt;</code> and
<code>&lt;AdditionalFiles&gt;</code>.
</p>

<p>
The <code>&lt;PackageReference&gt;</code> line informs the dotnet SDK which NuGet package to
download. At the time of writing, it's not possible to use NuGet in this manner
with Unity. We can instead download the StyleCop NuGet package and copy the
relevant DLL files. Using the NuGet CLI:
</p>

<div class="org-src-container">
<pre class="src src-sh">nuget install StyleCop.Analyzers -Version 1.2.0-beta.406 -Framework netstandard2.1
</pre>
</div>

<p>
Note that you may want to specify a different version or framework.
</p>

<p>
Adding the reference to the DLL directly would normally be as simple as the
following csproj configuration:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">Project</span> <span style="color: #00d3d0;">Sdk</span>=<span style="color: #79a8ff; font-style: italic;">"Microsoft.NET.Sdk"</span><span style="color: #e0e6f0;">&gt;</span>
  <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">ItemGroup</span><span style="color: #e0e6f0;">&gt;</span>
    <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">Analyzer</span> <span style="color: #00d3d0;">Include</span>=<span style="color: #79a8ff; font-style: italic;">"StyleCop/StyleCop.Analyzers.dll"</span> <span style="color: #e0e6f0;">/</span><span style="color: #e0e6f0;">&gt;</span>
  <span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">ItemGroup</span><span style="color: #e0e6f0;">&gt;</span>
<span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">Project</span><span style="color: #e0e6f0;">&gt;</span>
</pre>
</div>

<p>
&#x2026;except that Unity will clobber these changes anytime it regenerates project
files. More on that later.
</p>

<p>
The other important line, the <code>&lt;AdditionalFiles&gt;</code> include for stylecop.json, is
documented <a href="https://github.com/DotNetAnalyzers/StyleCopAnalyzers/blob/master/documentation/Configuration.md">here</a>. The simplest possible stylecop.json file looks like this:
</p>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #ffffff;">{</span>
  <span style="color: #b6a0ff;">"$schema"</span>: <span style="color: #79a8ff; font-style: italic;">"https://raw.githubusercontent.com/DotNetAnalyzers/StyleCopAnalyzers/master/StyleCop.Analyzers/StyleCop.Analyzers/Settings/stylecop.schema.json"</span>
<span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
We will now focus on the issue of the clobbered configuration.
</p>
</div>
</div>

<div id="outline-container-org-db464226-866d-47aa-9166-d077bba8eeec" class="outline-2">
<h2 id="org-db464226-866d-47aa-9166-d077bba8eeec">Previous solutions that no longer work</h2>
<div class="outline-text-2" id="text-org-db464226-866d-47aa-9166-d077bba8eeec">
<p>
Elsewhere online, you may see solutions that use the undocumented
<code>OnGeneratedCSProject</code> hook to modify csproj files to add a reference to the
assembly (<a href="https://github.com/ImLp/Unity-StyleCop">example 1</a>, <a href="https://www.nowsprinting.com/entry/2021/11/01/083258">example 2</a>). Unfortunately, this hook was <a href="https://github.com/Unity-Technologies/UnityCsReference/commit/0b34d6caff4a5ca3253c2327cee34c08a52ba745">unceremoniously
dropped</a> in the 2021.1 series.
</p>
</div>
</div>

<div id="outline-container-org-e2cfc7cd-42d2-48a7-acfd-fe6c8a464757" class="outline-2">
<h2 id="org-e2cfc7cd-42d2-48a7-acfd-fe6c8a464757">Directory.Build.props to the rescue</h2>
<div class="outline-text-2" id="text-org-e2cfc7cd-42d2-48a7-acfd-fe6c8a464757">
<p>
Fortunately, we can place these configuration changes in a special file:
<a href="https://docs.microsoft.com/en-us/visualstudio/msbuild/customize-your-build?view=vs-2019#directorybuildprops-and-directorybuildtargets">Directory.Build.props</a>. Essentially, this is an XML file that gets pulled in with
every csproj file in the directory its located without actually modifying those
files.
</p>

<p>
The solution is that simple: we can create a Directory.Build.props file to make
the above configuration changes.
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">Project</span><span style="color: #e0e6f0;">&gt;</span>
  <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">ItemGroup</span><span style="color: #e0e6f0;">&gt;</span>
    <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">Analyzer</span> <span style="color: #00d3d0;">Include</span>=<span style="color: #79a8ff; font-style: italic;">"StyleCop/StyleCop.Analyzers.dll"</span> <span style="color: #e0e6f0;">/</span><span style="color: #e0e6f0;">&gt;</span>
    <span style="color: #e0e6f0;">&lt;</span><span style="color: #feacd0;">AdditionalFiles</span> <span style="color: #00d3d0;">Include</span>=<span style="color: #79a8ff; font-style: italic;">"stylecop.json"</span> <span style="color: #e0e6f0;">/</span><span style="color: #e0e6f0;">&gt;</span>
  <span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">ItemGroup</span><span style="color: #e0e6f0;">&gt;</span>
<span style="color: #e0e6f0;">&lt;</span><span style="color: #e0e6f0;">/</span><span style="color: #feacd0;">Project</span><span style="color: #e0e6f0;">&gt;</span>
</pre>
</div>

<p>
The solution turns out to be rather simple in the end, fortunately.
</p>

<p>
Now with any LSP-enabled editor, you should begin to see the various StyleCop
lints in your code. You may need to enable analyzers by creating or adding to
the omnisharp.json file in the same directory as your
projects/Directory.Build.props:
</p>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #ffffff;">{</span>
  <span style="color: #b6a0ff;">"RoslynExtensionsOptions"</span>: <span style="color: #ff62d4;">{</span>
    <span style="color: #b6a0ff;">"enableAnalyzersSupport"</span>: <span style="color: #00bcff;">true</span>
  <span style="color: #ff62d4;">}</span>
<span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org-b851af71-d447-4b8f-8eac-13f751e7d4c9" class="outline-2">
<h2 id="org-b851af71-d447-4b8f-8eac-13f751e7d4c9">Next Steps</h2>
<div class="outline-text-2" id="text-org-b851af71-d447-4b8f-8eac-13f751e7d4c9">
<p>
Once you've configured stylecop.json, you might want to fine-tune which rules
are enabled. Traditionally this is done with a <a href="https://github.com/DotNetAnalyzers/StyleCopAnalyzers/blob/master/StyleCop.Analyzers/StyleCop.Analyzers.CodeFixes/rulesets/StyleCopAnalyzersDefault.ruleset">ruleset</a> file, which is, frankly,
a huge pain to create and edit by hand, especially if you're not using Visual
Studio. Luckily, the language server is capable of reading rules from
<a href="https://editorconfig.org/">.editorconfig</a> files.
</p>

<p>
First, ensure OmniSharp is configured to use .editorconfig by adding or editing
the omnisharp.json file located in the same directory as your generated csproj
files:
</p>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #ffffff;">{</span>
  <span style="color: #b6a0ff;">"FormattingOptions"</span>: <span style="color: #ff62d4;">{</span>
    <span style="color: #b6a0ff;">"enableEditorConfigSupport"</span>: <span style="color: #00bcff;">true</span>
  <span style="color: #ff62d4;">}</span>
<span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Then, create or add the following to your .editorconfig file in the same
directory.
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #a8a8a8; font-style: italic;"># </span><span style="color: #a8a8a8; font-style: italic;">Remove the line below if you want to inherit</span>
<span style="color: #a8a8a8; font-style: italic;"># </span><span style="color: #a8a8a8; font-style: italic;">.editorconfig settings from higher directories</span>
<span style="color: #00d3d0;">root</span> = true

<span style="color: #a8a8a8; font-style: italic;"># </span><span style="color: #a8a8a8; font-style: italic;">C# files</span>
[<span style="color: #6ae4b9;">*.cs</span>]

<span style="color: #a8a8a8; font-style: italic;"># </span><span style="color: #a8a8a8; font-style: italic;">EXAMPLE: Disable all naming convention analyzers.</span>
<span style="color: #00d3d0;">dotnet_diagnostic.SA1300.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1301.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1302.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1303.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1304.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1305.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1306.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1307.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1308.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1309.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1310.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1311.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1312.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1313.severity</span> = none
<span style="color: #00d3d0;">dotnet_diagnostic.SA1314.severity</span> = none
</pre>
</div>

<p>
You can see the names of all of tweakable rules in the ruleset file linked
above.
</p>

<p>
<b>Sidenote:</b> OmniSharp provides an impressive number of custom .editorconfig
settings that can be used to unify and enforce your code style across a variety
of editors. Unfortunately, generating an extensive set of tweaks from scratch is
very difficult without Visual Studio, as a lot of the options aren't documented.
As is evident by this article, this is a frustrating pattern with a lot of C#
tooling that hopefully will improve in the future.
</p>
</div>
</div>
<div class="taglist"><a href="https://eliza.sh/tags.html">Tags</a>: <a href="https://eliza.sh/tag-unity.html">unity</a> <a href="https://eliza.sh/tag-csharp.html">csharp</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
